{
  "Description": "The problem involves modeling the atomic structure of fullerenes, a form of carbon molecules composed of atoms arranged in a spherical shape resembling a hollow ball. The challenge is to find an optimal arrangement of atoms that minimizes the total potential energy of the system. The energy is determined by the interactions between the atoms and is modelled using Brenners potential. Using simulated annealing, the algorithm explores the configuration space of the atoms by iteratively adjusting their positions while attempting to minimize the system's energy.",
  "Steps": "Start with an initial configuration of atoms arranged randomly on a sphere. Generate a shifted configuration by slightly moving the positions of the atoms. Calculate the total potential energy of the new system. Accept the new configuration if it leads to a decrease in energy. If the energy increases, accept it with a probability that depends on the current 'temperature' of the system. Gradually lower the temperature according to a cooling schedule to reduce the probability of accepting worse configurations. Repeat until the system reaches a state where the energy is sufficiently minimized or the stopping condition is met.",
  "No. atoms": "Specifies the number of atoms in the fullerene system.",
  "Init r": "The initial radius fo a sphere on which the atoms are randomly placed at the beginning of the optimization process.",
  "Min beta, Max beta, beta exponent": "Beta represents the inverse temperature in the simulated annealing algorithm. Those parameters are used to tune cooling schedule.",
  "w_r, w_phi, w_theta, w_all": "Scaling factor for changes applied to the system during optimization.",
  "NN scaling": "Specifies the scaling factor for determining the nearest neighbors (used for plotting). Nearest neighbors distance is calculated as NN distance = NN scaling · avg distance of atoms from the center.",
  "Max iter": "The maximum number of iterations for the optimization algorithm.",
  "Refresh interval": "Sets how often the GUI updates the plots during the optimization process."
}